#!/usr/bin/env python
# encoding: utf-8
'''
@author: yuxiqian
@license: MIT
@contact: akaza_akari@sjtu.edu.cn
@software: electsys-api
@file: /shared/school_id.py
@time: 2019/1/6
'''


school_id = {"01000": '船舶海洋与建筑工程学院',
             "02000": '机械与动力工程学院',
             "03000": '电子信息与电气工程学院',
             "03600": '信息安全工程学院',
             "03700": '软件学院',
             "04000": '电力学院（原）',
             "05000": '材料科学与工程学院',
             "06000": '机械工程学院（原）',
             "07000": '理学院',
             "07100": '数学系',
             "07200": '物理系',
             "08000": '生命科学技术学院',
             "08200": '生物医学工程学院',
             "09000": '人文学院',
             "09600": '科学史与科学文化研究院',
             "10000": '建筑工程与力学学院(原)',
             "11000": '化学化工学院',
             "12000": '安泰经济与管理学院',
             "13000": '国际与公共事务学院',
             "14000": '外国语学院',
             "15000": '农业与生物学院',
             "16000": '环境科学与工程学院',
             "17000": '药学院',
             "18000": '医学院（并校前）',
             "19000": '凯原法学院',
             "20000": '媒体与设计学院',
             "21000": '微电子学院',
             "22000": '继续教育学院',
             "23000": '马克思主义学院',
             "24000": '致远学院',
             "25100": '体育系',
             "26000": '巴黎高科卓越工程师学院',
             "29000": '塑性成形系（原）',
             "29100": '塑性成形技术与装备研究院',
             "30000": '医学院(原二医大)',
             "31000": '技术学院',
             "32000": '成人教育部',
             "33000": '图书馆',
             "34000": '微纳米科学技术研究院',
             "35000": '高等教育研究院',
             "36000": '国际教育学院',
             "37000": '密西根学院',
             "38000": '上海高级金融学院',
             "39000": '创业学院',
             "40000": '上海中医药大学',
             "41000": '工程训练中心',
             "41300": '航空航天学院',
             "50400": '党委宣传部',
             "50500": '学指委、团委(含学生处、人武部)',
             "50501": '军事教研室',
             "60200": '教务处',
             "70000": '医学院'
             }
